import {
  MonsterName,
  MonsterBlastResistanceData,
  WeaponType,
  WeaponTypeBlastCoef,
  WeaponTypeHitsPerSecond,
  MonsterHPData,
} from "./types";

export const monsterNames: MonsterName[] = [
  "도스쟈그라스",
  "쿠루루야크",
  "푸케푸케",
  "푸케푸케 아종",
  "볼보로스",
  "도스기르오스",
  "토비카가치",
  "파오우르무",
  "파오우르무 아종",
  "쥬라토도스",
  "안쟈나프",
  "리오레이아",
  "리오레이아 아종",
  "레이기에나",
  "디아블로스",
  "디아블로스 아종",
  "리오레우스",
  "리오레우스 아종",
  "라도발킨",
  "버프바로",
  "벨리오로스",
  "진오우거",
  "치치야크",
  "오도가론",
  "이블죠",
  "바살모스",
  "푸루푸루",
  "타마미츠네",
];

export const monsterBlastInitialResistanceData: MonsterBlastResistanceData = {
  도스쟈그라스: {
    "8": 731,
    "9": 844,
    "10": 936,
  },
  쿠루루야크: {
    "8": 1462,
    "9": 1688,
    "10": 1872,
  },
  푸케푸케: {
    "8": 1462,
    "9": 1688,
    "10": 1872,
  },
  "푸케푸케 아종": {
    "8": 1522,
    "9": 1757,
    "10": 1949,
  },
  볼보로스: {
    "8": 731,
    "9": 844,
    "10": 946,
  },
  도스기르오스: {
    "8": 1512,
    "9": 1746,
    "10": 1891,
  },
  토비카가치: {
    "8": 1512,
    "9": 1746,
    "10": 1911,
  },
  파오우르무: {
    "8": 731,
    "9": 844,
    "10": 946,
  },
  "파오우르무 아종": {
    "8": 1512,
    "9": 1746,
    "10": 1891,
  },
  쥬라토도스: {
    "8": 3059,
    "9": 3528,
    "10": 3821,
  },
  안쟈나프: {
    "8": 3094,
    "9": 3452,
    "10": 3860,
  },
  리오레이아: {
    "8": 3094,
    "9": 3452,
    "10": 3860,
  },
  "리오레이아 아종": {
    "8": 3129,
    "9": 3523,
    "10": 3899,
  },
  레이기에나: {
    "8": 1574,
    "9": 1818,
    "10": 1969,
  },
  디아블로스: {
    "8": 1574,
    "9": 1818,
    "10": 1969,
  },
  "디아블로스 아종": {
    "8": 1574,
    "9": 1818,
    "10": 1969,
  },
  리오레우스: {
    "8": 3156,
    "9": 3521,
    "10": 3938,
  },
  "리오레우스 아종": {
    "8": 3200,
    "9": 3596,
    "10": 3976,
  },
  라도발킨: {
    "8": 756,
    "9": 869,
    "10": 946,
  },
  버프바로: {
    "8": 765,
    "9": 878,
    "10": 946,
  },
  벨리오로스: {
    "8": 1512,
    "9": 1746,
    "10": 10,
  },
  진오우거: {
    "8": 1574,
    "9": 1818,
    "10": 1949,
  },
  치치야크: {
    "8": 1462,
    "9": 1694,
    "10": 1872,
  },
  오도가론: {
    "8": 1530,
    "9": 1767,
    "10": 1891,
  },
  이블죠: {
    "8": 1558,
    "9": 1800,
    "10": 1930,
  },
  바살모스: {
    "8": 1512,
    "9": 1746,
    "10": 1891,
  },
  푸루푸루: {
    "8": 1512,
    "9": 1746,
    "10": 1891,
  },
  타마미츠네: {
    "8": 1512,
    "9": 1746,
    "10": 1891,
  },
};

export const monsterHPdata: MonsterHPData = {
  도스쟈그라스: {
    "8": 32080,
    "9": 67780,
    "10": 139120,
  },
  쿠루루야크: {
    "8": 30580,
    "9": 64560,
    "10": 132480,
  },
  푸케푸케: {
    "8": 30580,
    "9": 64560,
    "10": 132480,
  },
  "푸케푸케 아종": {
    "8": 56450,
    "9": 121150,
    "10": 215800,
  },
  볼보로스: {
    "8": 23560,
    "9": 49950,
    "10": 99160,
  },
  도스기르오스: {
    "8": 33680,
    "9": 71340,
    "10": 141680,
  },
  토비카가치: {
    "8": 31960,
    "9": 74240,
    "10": 143340,
  },
  파오우르무: {
    "8": 38600,
    "9": 74920,
    "10": 148760,
  },
  "파오우르무 아종": {
    "8": 42250,
    "9": 90300,
    "10": 166660,
  },
  쥬라토도스: {
    "8": 25720,
    "9": 54680,
    "10": 105600,
  },
  안쟈나프: {
    "8": 39040,
    "9": 83240,
    "10": 156880,
  },
  리오레이아: {
    "8": 38240,
    "9": 81520,
    "10": 153640,
  },
  "리오레이아 아종": {
    "8": 42920,
    "9": 91720,
    "10": 169300,
  },
  레이기에나: {
    "8": 45080,
    "9": 96520,
    "10": 174880,
  },
  디아블로스: {
    "8": 41420,
    "9": 88670,
    "10": 160600,
  },
  "디아블로스 아종": {
    "8": 55250,
    "9": 112080,
    "10": 187700,
  },
  리오레우스: {
    "8": 43720,
    "9": 93600,
    "10": 169520,
  },
  "리오레우스 아종": {
    "8": 49020,
    "9": 105300,
    "10": 187600,
  },
  라도발킨: {
    "8": 31940,
    "9": 67760,
    "10": 134600,
  },
  버프바로: {
    "8": 23880,
    "9": 46360,
    "10": 92080,
  },
  벨리오로스: {
    "8": 35040,
    "9": 74720,
    "10": 140840,
  },
  진오우거: {
    "8": 45100,
    "9": 95250,
    "10": 177700,
  },
  치치야크: {
    "8": 30500,
    "9": 64500,
    "10": 132450,
  },
  오도가론: {
    "8": 29300,
    "9": 57000,
    "10": 113300,
  },
  이블죠: {
    "8": 55800,
    "9": 118900,
    "10": 224150,
  },
  바살모스: {
    "8": 23600,
    "9": 45200,
    "10": 99200,
  },
  푸루푸루: {
    "8": 30300,
    "9": 64000,
    "10": 127500,
  },
  타마미츠네: {
    "8": 44400,
    "9": 94000,
    "10": 174600,
  },
};

export const weaponTypeBlastCoef: WeaponTypeBlastCoef = {
  [WeaponType.LongSword]: 1.4,
  [WeaponType.Bow]: 0.6,
};

export const weaponTypeHitsPerSecond: WeaponTypeHitsPerSecond = {
  [WeaponType.LongSword]: 1,
  [WeaponType.Bow]: 1.87,
};

export const teostraBlastPowderLvProbabilityIncrease = {
  "0": 0,
  "1": 15,
  "2": 30,
  "3": 45,
};

export const statusSneakAttackLvProbabilityIncrease = {
  "0": 0,
  "1": 10,
  "2": 20,
  "3": 30,
  "4": 40,
  "5": 100,
};

export const blastAttackLvIncrease = {
  "0": 0,
  "1": 50,
  "2": 75,
  "3": 100,
  "4": 125,
  "5": 150,
};
